import { Container } from 'react-bootstrap';

function About() {
    return (
        <main>
            <Container className="mt-3">
                <h2>Про благодійний фонд</h2>
            </Container>
            <Container>
                <h3 style={{textAlign: 'left'}}>Ласкаво просимо до ValorAid Network!</h3>
                <p style={{textAlign: 'left'}}>Ми є благодійним фондом, створеним з метою підтримки та допомоги Силам оборони України та 
                    надання гуманітарної допомоги тим, хто постраждав від наслідків війни. Наша місія полягає 
                    в об'єднанні зусиль задля підтримки тих, хто бореться за свободу, незалежність та мир у нашій країні.
                </p>

                <h4 style={{textAlign: 'left'}}>Наші цілі та завдання</h4>
                <h5 style={{textAlign: 'left'}}>Допомога Силам оборони України</h5>
                <p style={{textAlign: 'left'}}>ValorAid Network активно підтримує українських військових, які захищають наші кордони та незалежність. 
                    Ми забезпечуємо їх необхідним обладнанням, медичним спорядженням, транспортними засобами 
                    та іншими важливими ресурсами. Разом ми зміцнюємо нашу обороноздатність та забезпечуємо гідний захист наших громадян.
                </p>

                <h5 style={{textAlign: 'left'}}>Гуманітарна допомога</h5>
                <p style={{textAlign: 'left'}}>Ми не забуваємо і про мирних жителів, які постраждали від бойових дій. Наша гуманітарна допомога охоплює 
                    постачання продовольства, медикаментів, одягу та інших необхідних речей для людей, що опинилися у скрутному становищі. 
                    Ми прагнемо повернути надію та впевненість тим, хто втратив усе через війну.
                </p >

                <h4 style={{textAlign: 'left'}}>Як ви можете допомогти</h4>
                <h5 style={{textAlign: 'left'}}>Пожертвування</h5>
                <p style={{textAlign: 'left'}}>Ваша фінансова підтримка є надзвичайно важливою для нас. Кожна пожертва допомагає нам забезпечити необхідну допомогу тим, 
                    хто її потребує найбільше. Ви можете зробити свій внесок через наш вебсайт або звернутися до нас для отримання додаткової інформації.
                </p>

                <h5 style={{textAlign: 'left'}}>Волонтерство</h5>
                <p style={{textAlign: 'left'}}>Ми завжди шукаємо волонтерів, готових допомогти у наших проектах. Якщо ви маєте бажання та можливість долучитися до нашої команди, 
                    будь ласка, зареєструйтеся, тим самим надіславши заявку. Ваша підтримка на місцях може змінити життя багатьох людей.
                </p>

                <h5 style={{textAlign: 'left'}}>Поширення інформації</h5>
                <p style={{textAlign: 'left'}}>Допоможіть нам поширити інформацію про нашу діяльність. Розкажіть своїм друзям, родичам та колегам про ValorAid Network. 
                    Разом ми можемо досягти більшого!
                </p>
            </Container>
        </main>
    );
}

export default About;